; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-3-7)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	)
(:init
	(at plane1 city6)
	(= (capacity plane1) 6893)
	(= (fuel plane1) 1415)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 10)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at plane2 city0)
	(= (capacity plane2) 5891)
	(= (fuel plane2) 12)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 6)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 3)
	(at plane3 city8)
	(= (capacity plane3) 8344)
	(= (fuel plane3) 2150)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 7)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 5)
	(at person1 city3)
	(at person2 city4)
	(at person3 city0)
	(at person4 city1)
	(at person5 city8)
	(at person6 city0)
	(at person7 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 785)
	(= (distance city0 city2) 500)
	(= (distance city0 city3) 561)
	(= (distance city0 city4) 958)
	(= (distance city0 city5) 927)
	(= (distance city0 city6) 613)
	(= (distance city0 city7) 553)
	(= (distance city0 city8) 743)
	(= (distance city1 city0) 785)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 831)
	(= (distance city1 city3) 952)
	(= (distance city1 city4) 812)
	(= (distance city1 city5) 607)
	(= (distance city1 city6) 640)
	(= (distance city1 city7) 669)
	(= (distance city1 city8) 906)
	(= (distance city2 city0) 500)
	(= (distance city2 city1) 831)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 882)
	(= (distance city2 city4) 768)
	(= (distance city2 city5) 720)
	(= (distance city2 city6) 863)
	(= (distance city2 city7) 845)
	(= (distance city2 city8) 584)
	(= (distance city3 city0) 561)
	(= (distance city3 city1) 952)
	(= (distance city3 city2) 882)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 801)
	(= (distance city3 city5) 688)
	(= (distance city3 city6) 867)
	(= (distance city3 city7) 910)
	(= (distance city3 city8) 531)
	(= (distance city4 city0) 958)
	(= (distance city4 city1) 812)
	(= (distance city4 city2) 768)
	(= (distance city4 city3) 801)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 738)
	(= (distance city4 city6) 613)
	(= (distance city4 city7) 985)
	(= (distance city4 city8) 615)
	(= (distance city5 city0) 927)
	(= (distance city5 city1) 607)
	(= (distance city5 city2) 720)
	(= (distance city5 city3) 688)
	(= (distance city5 city4) 738)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 678)
	(= (distance city5 city7) 771)
	(= (distance city5 city8) 616)
	(= (distance city6 city0) 613)
	(= (distance city6 city1) 640)
	(= (distance city6 city2) 863)
	(= (distance city6 city3) 867)
	(= (distance city6 city4) 613)
	(= (distance city6 city5) 678)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 740)
	(= (distance city6 city8) 729)
	(= (distance city7 city0) 553)
	(= (distance city7 city1) 669)
	(= (distance city7 city2) 845)
	(= (distance city7 city3) 910)
	(= (distance city7 city4) 985)
	(= (distance city7 city5) 771)
	(= (distance city7 city6) 740)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 543)
	(= (distance city8 city0) 743)
	(= (distance city8 city1) 906)
	(= (distance city8 city2) 584)
	(= (distance city8 city3) 531)
	(= (distance city8 city4) 615)
	(= (distance city8 city5) 616)
	(= (distance city8 city6) 729)
	(= (distance city8 city7) 543)
	(= (distance city8 city8) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane3 city1)
	(at person1 city7)
	(at person2 city3)
	(at person3 city7)
	(at person4 city5)
	(at person5 city5)
	(at person6 city3)
	(at person7 city5)
	))

(:metric minimize (+ (* 1 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (refuel plane2 city0)
   changed: (fuel plane2) from 12 to 5891
   goals met: 0 of 8
2. (board person5 plane3 city8)
   deleted: (at person5 city8)
   added: (in person5 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 0 of 8
3. (fly plane3 city8 city5)
   deleted: (at plane3 city8)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 0 to 1848, (fuel plane3) from 2150 to 302
   goals met: 0 of 8
4. (debark person5 plane3 city5)
   deleted: (in person5 plane3)
   added: (at person5 city5)
   changed: (onboard plane3) from 1 to 0
   goals met: 1 of 8
5. (board person6 plane2 city0)
   deleted: (at person6 city0)
   added: (in person6 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 8
6. (refuel plane3 city5)
   changed: (fuel plane3) from 302 to 8344
   goals met: 1 of 8
7. (fly plane3 city5 city1)
   deleted: (at plane3 city5)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 1848 to 3669, (fuel plane3) from 8344 to 6523
   goals met: 2 of 8
8. (board person4 plane3 city1)
   deleted: (at person4 city1)
   added: (in person4 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 2 of 8
9. (board person3 plane2 city0)
   deleted: (at person3 city0)
   added: (in person3 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 2 of 8
10. (fly plane2 city0 city3)
   deleted: (at plane2 city0)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 3669 to 4791, (fuel plane2) from 5891 to 4769
   goals met: 2 of 8
11. (debark person6 plane2 city3)
   deleted: (in person6 plane2)
   added: (at person6 city3)
   changed: (onboard plane2) from 2 to 1
   goals met: 3 of 8
12. (board person1 plane2 city3)
   deleted: (at person1 city3)
   added: (in person1 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 3 of 8
13. (fly plane3 city1 city2)
   deleted: (at plane3 city1)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 4791 to 7284, (fuel plane3) from 6523 to 4030
   goals met: 2 of 8
14. (board person7 plane3 city2)
   deleted: (at person7 city2)
   added: (in person7 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 2 of 8
15. (fly plane3 city2 city5)
   deleted: (at plane3 city2)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 7284 to 9444, (fuel plane3) from 4030 to 1870
   goals met: 2 of 8
16. (debark person4 plane3 city5)
   deleted: (in person4 plane3)
   added: (at person4 city5)
   changed: (onboard plane3) from 2 to 1
   goals met: 3 of 8
17. (debark person7 plane3 city5)
   deleted: (in person7 plane3)
   added: (at person7 city5)
   changed: (onboard plane3) from 1 to 0
   goals met: 4 of 8
18. (fly plane3 city5 city1)
   deleted: (at plane3 city5)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 9444 to 11265, (fuel plane3) from 1870 to 49
   goals met: 5 of 8
19. (fly plane2 city3 city7)
   deleted: (at plane2 city3)
   added: (at plane2 city7)
   changed: (total-fuel-used) from 11265 to 13085, (fuel plane2) from 4769 to 2949
   goals met: 5 of 8
20. (debark person1 plane2 city7)
   deleted: (in person1 plane2)
   added: (at person1 city7)
   changed: (onboard plane2) from 2 to 1
   goals met: 6 of 8
21. (debark person3 plane2 city7)
   deleted: (in person3 plane2)
   added: (at person3 city7)
   changed: (onboard plane2) from 1 to 0
   goals met: 7 of 8
22. (fly plane2 city7 city4)
   deleted: (at plane2 city7)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 13085 to 15055, (fuel plane2) from 2949 to 979
   goals met: 7 of 8
23. (board person2 plane2 city4)
   deleted: (at person2 city4)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 7 of 8
24. (refuel plane2 city4)
   changed: (fuel plane2) from 979 to 5891
   goals met: 7 of 8
25. (fly plane2 city4 city3)
   deleted: (at plane2 city4)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 15055 to 16657, (fuel plane2) from 5891 to 4289
   goals met: 7 of 8
26. (debark person2 plane2 city3)
   deleted: (in person2 plane2)
   added: (at person2 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 8 of 8
